const dataJson = [
  '间距 Space',
  '模块间距、元素间距',
  '模块间距',
  '模块间距是划分元素与元素之间的距离，利用间距大小表达信息之间的关系，同时做到类别区分，对页面内的元素做到合理的规划且具有一定的视觉导向作用。经过论证，我们决定间距的基础网格为4，在此基础上以4的倍数进行设置间距，以此达到韵律感和美观性。',
  '2/3/4列 同一板块间内容模块上下左右间距统一间隔12px。',
  '5列板块情况下，模块间距为15px。',
  '购物车/结算页/账户中心的板块较大，间距大一些会让整个页面更有空间和节奏感，所以间距统一为20px。',
  '两个不同板块之间的上下间距为48px。',
  '纵向间距',
  '组件或区块的纵向间距，以4*n为基准，依据信息分组关系进行选用。',
  '横向间距',
  '组件或区块的横向间距，以4*n为基准，依据信息分组关系进行选用。',
  '元素间距',
  '元素间距是各个元素组合的间距，以4的倍数为基础对间距进行规范。',
  '图标与文字间距：8px',
  '图标与按钮内间距：30px以内，以4*n为基础',
  '文字与按钮内间距：30以内，以4*n为基础',
  '按钮与按钮间距',
  '左右排布：按钮之间间距为10px，主要按钮居右。',
  '垂直排布：按钮之间间距为16px，主要按钮在上方。',
  "登录输入按钮间距",
];

export const number = [4, 8, 12, 16, 20, 24, 28, 32, 36, 40, '…'];

export default dataJson;
